-- MySQL dump 10.13  Distrib 8.0.36, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: computer
-- ------------------------------------------------------
-- Server version	8.0.36

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `food`
--

DROP TABLE IF EXISTS `food`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `food` (
  `food_num` bigint NOT NULL AUTO_INCREMENT,
  `food_content` varchar(255) NOT NULL,
  `food_name` varchar(255) NOT NULL,
  `price` int NOT NULL,
  `category` varchar(255) NOT NULL,
  `mod_date` datetime(6) DEFAULT NULL,
  `reg_date` datetime(6) DEFAULT NULL,
  PRIMARY KEY (`food_num`)
) ENGINE=InnoDB AUTO_INCREMENT=1051 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `food`
--

LOCK TABLES `food` WRITE;
/*!40000 ALTER TABLE `food` DISABLE KEYS */;
INSERT INTO `food` VALUES (1002,'펩시제로콜라입니다.','펩시제로콜라',2000,'음료','2024-05-07 15:02:04.015792','2024-05-07 15:02:04.015792'),(1003,'펩시콜라입니다.','펩시콜라',2000,'음료','2024-05-07 15:19:20.662504','2024-05-07 15:19:20.662504'),(1004,'매콤 달달 떡볶이입니다.','떡볶이',4000,'분식','2024-05-07 15:29:01.308452','2024-05-07 15:29:01.308452'),(1005,'칠성사이다입니다.','칠성사이다',2000,'음료','2024-05-07 15:57:38.010676','2024-05-07 15:57:38.010676'),(1006,'포카리스웨트 340ml 캔입니다.','포카리스웨트 캔',2000,'음료','2024-05-07 17:53:43.720560','2024-05-07 17:53:43.720560'),(1007,'달콤바삭 치즈볼입니다.','치즈볼 ',3000,'튀김','2024-05-07 17:57:25.756338','2024-05-07 17:57:25.756338'),(1008,'매콤 달달 짜장떡볶이입니다.','짜장떡볶이',4000,'분식','2024-05-08 15:03:04.015290','2024-05-08 15:03:04.015290'),(1009,'한 끼 대용으로 먹을 수 있는 새우볶음밥입니다.','새우볶음밥',5000,'밥','2024-05-08 15:06:47.307584','2024-05-08 15:06:47.307584'),(1010,'바삭 달달 간장치킨입니다.','간장치킨',5000,'튀김','2024-05-08 15:08:31.733585','2024-05-08 15:08:31.733585'),(1011,'옛날 맛 그래도 김치찐만두입니다.','김치찐만두',3000,'분식','2024-05-08 15:09:20.086417','2024-05-08 15:09:20.086417'),(1012,'갈비 맛 그대로 유지한 갈비만두입니다.','갈비만두',3000,'분식','2024-05-08 15:11:58.714925','2024-05-08 15:11:58.714925'),(1013,'많은 분들이 찾는 핫식스입니다.','HOT6',2000,'음료','2024-05-08 15:12:34.895969','2024-05-08 15:12:34.895969'),(1014,'포도와 탄산의 조합, 웰치스 포도맛','웰치스 포도',2000,'음료','2024-05-08 15:13:06.397026','2024-05-08 15:13:06.397026'),(1015,'의성마늘 소세지입니다.','소세지 (의성마늘)',2500,'분식','2024-05-08 15:13:35.775706','2024-05-08 15:13:35.775706'),(1016,'길거리에서 파는 맛 그대로 옮겼다. 타코야끼','타코야끼',3500,'분식','2024-05-08 15:14:10.151889','2024-05-08 15:14:10.151889'),(1017,'달걀후라이 추가 옵션입니다.','달걀후라이 추가',700,'밥','2024-05-08 15:14:54.531462','2024-05-08 15:14:54.531462'),(1018,'한 끼 대용 달달한 스팸마요덮밥입니다.','스팸마요덮밥',5500,'밥','2024-05-08 15:19:19.726010','2024-05-08 15:19:19.726010'),(1019,'누구나 좋아하는 김치볶음밥입니다.','김치볶음밥',5500,'밥','2024-05-08 15:21:37.358240','2024-05-08 15:21:37.358240'),(1020,'매콤하고 맛있는 낚지볶음밥입니다.','낚지볶음밥',5500,'밥','2024-05-08 15:25:52.323656','2024-05-08 15:25:52.323656'),(1021,'모든 사람들이 먹어봤다. 참치마요덮밥','참치마요덮밥',5500,'밥','2024-05-08 15:29:12.630272','2024-05-08 15:29:12.630272'),(1022,'밥 추가 메뉴입니다.','밥 추가',1000,'밥','2024-05-08 15:29:53.227366','2024-05-08 15:29:53.227366'),(1023,'감자를 얇은 튀김으로, 해쉬브라운입니다.','해쉬브라운',2000,'튀김','2024-05-08 15:31:55.251670','2024-05-08 15:31:55.251670'),(1024,'연예인도 찾아 먹는 그 음식. 소떡소떡','소떡소떡',2500,'분식','2024-05-08 15:33:37.356334','2024-05-08 15:33:37.356334'),(1025,'신라면 봉지입니다.','신라면',3000,'라면','2024-05-08 15:34:28.657325','2024-05-08 15:34:28.657325'),(1026,'너구리 봉지라면입니다. 너구리 한 마리 몰고가세요!','너구리',3000,'라면','2024-05-08 15:34:58.609863','2024-05-08 15:34:58.609863'),(1027,'볶음면 최상위 포식자, 매콤함의 강도가 다르다!! 불닭볶음면','불닭볶음면',3000,'라면','2024-05-08 15:36:14.474211','2024-05-08 15:36:14.474211'),(1028,'누구나 좋아하는 짜장라면, 짜파게티입니다.','짜파게티',3000,'라면','2024-05-08 15:36:41.000379','2024-05-08 15:36:41.000379'),(1029,'모짜렐라 치즈가 들어간 쭉쭉 늘어나는 치즈스틱입니다.','치즈스틱',2500,'튀김','2024-05-08 15:39:50.611956','2024-05-08 15:39:50.611956'),(1030,'진라면 매운맛입니다.','진라면 매운맛',3000,'라면','2024-05-08 15:41:28.373185','2024-05-08 15:41:28.373185'),(1031,'호불호가 갈리는 맛, 진라면 순한맛','진라면 순한맛',3000,'라면','2024-05-08 15:42:23.434018','2024-05-08 15:42:23.434018'),(1032,'해장으로 제격, 진짬뽕입니다.','진짬뽕',3000,'라면','2024-05-08 15:43:58.204311','2024-05-08 15:43:58.204311'),(1033,'모든 사람의 국민간식, 감자튀김입니다.','감자튀김',2500,'튀김','2024-05-08 15:44:25.154357','2024-05-08 15:44:25.154357'),(1034,'오징어의 쫄깃한 식감과 튀김의 바삭함이 만났다.','오징어튀김',2500,'튀김','2024-05-08 15:48:21.454221','2024-05-08 15:48:21.454221'),(1035,'남녀노소 누구나 좋아하는 김말이튀김입니다.','김말이튀김',2500,'튀김','2024-05-08 15:49:22.411458','2024-05-08 15:49:22.411458'),(1036,'통통한 새우살이 통채로 들어갔다.','새우튀김',2500,'튀김','2024-05-08 15:50:42.086574','2024-05-08 15:50:42.086574'),(1037,'호불호가 없는 아이스 아메리카노입니다.','아이스 아메리카노',3000,'카페','2024-05-08 18:10:01.714359','2024-05-08 18:10:01.714359'),(1038,'아이스 카라멜 마키아또입니다. 달달한 맛이 일품입니다.','아이스 카라멜 마키아또',4500,'카페','2024-05-08 18:11:34.492997','2024-05-08 18:11:34.492997'),(1039,'아이스 카페 라떼입니다. 대표적인 라떼 메뉴입니다.','아이스 카페 라떼',4000,'카페','2024-05-08 18:12:22.356913','2024-05-08 18:12:22.356913'),(1040,'휘핑크림이 올라간 아이스 카페 모카입니다.','아이스 카페 모카',4500,'카페','2024-05-08 18:22:17.389624','2024-05-08 18:22:17.389624'),(1041,'이번에 새로나온 신메뉴 딸기 라떼입니다.','딸기라떼',5000,'카페','2024-05-08 18:22:49.298116','2024-05-08 18:22:49.298116'),(1042,'부드러운 티라미수와 초콜릿이 만났다. 아이스 티라미수 초콜릿','아이스 티라미수 초콜릿',5500,'카페','2024-05-08 18:23:52.460910','2024-05-08 18:23:52.460910'),(1043,'커피, 모카 소스, 진한 초콜릿 팁이 입안 가득 느껴지는 프라푸치노입니다.','자바 칩 프라푸치노',6000,'카페','2024-05-08 18:25:05.653049','2024-05-08 18:25:05.653049'),(1044,'달콤한 망고를 통채로 갈아 만든 망고 스무디입니다.','망고 스무디',5500,'카페','2024-05-08 18:26:07.795472','2024-05-08 18:26:07.795472'),(1047,'몬스터 기본 음료 캔입니다.','몬스터',2500,'음료','2024-05-10 16:23:32.459415','2024-05-10 16:23:32.459415'),(1048,'달콤한 하와이에서 먹는 음료의 맛을 느낄 수 있습니다!!','블루하와이',2000,'음료','2024-05-22 17:19:54.878297','2024-05-22 17:19:54.878297'),(1049,'진짜 수박을 갈아 만든 수박주스입니다!!','수박주스',3000,'음료','2024-05-22 17:20:21.407848','2024-05-22 17:20:21.407848'),(1050,'직접 만들고 손맛이 가득한 계란말이입니다!!','계란말이',4000,'분식','2024-05-22 17:21:19.074642','2024-05-22 17:21:19.074642');
/*!40000 ALTER TABLE `food` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-05-24 16:22:16
